In [60]:
import pandas as pd

In [61]:
df= pd.read_csv("HR-Employee-Attrition.csv")

In [62]:
df.head(10)

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
5,32,No,Travel_Frequently,1005,Research & Development,2,2,Life Sciences,1,8,...,3,80,0,8,2,2,7,7,3,6
6,59,No,Travel_Rarely,1324,Research & Development,3,3,Medical,1,10,...,1,80,3,12,3,2,1,0,0,0
7,30,No,Travel_Rarely,1358,Research & Development,24,1,Life Sciences,1,11,...,2,80,1,1,2,3,1,0,0,0
8,38,No,Travel_Frequently,216,Research & Development,23,3,Life Sciences,1,12,...,2,80,0,10,2,3,9,7,1,8
9,36,No,Travel_Rarely,1299,Research & Development,27,3,Medical,1,13,...,2,80,2,17,3,2,7,7,7,7

In [63]:
df.shape
df.columns

df.columns=['age', 'attrition', 'business_travel', 'daily_rate', 'department',
 'distance_from_home', 'education', 'education_field', 'employee_count',
 'employee_number', 'environment_satisfaction', 'gender', 'hourly_rate',
 'job_involvement', 'job_level', 'job_role', 'job_satisfaction',
 'marital_status', 'monthly_income', 'monthly_rate', 'num_companies_worked',
 'over18', 'over_time', 'percent_salary_hike', 'performance_rating',
 'relationship_satisfaction', 'standard_hours', 'stock_option_level',
 'total_working_years', 'training_times_last_year', 'work_life_balance',
 'years_at_company', 'years_in_current_role', 'years_since_last_promotion',
 'years_with_curr_manager']

In [64]:
df.head(10)

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,...,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
5,32,No,Travel_Frequently,1005,Research & Development,2,2,Life Sciences,1,8,...,3,80,0,8,2,2,7,7,3,6
6,59,No,Travel_Rarely,1324,Research & Development,3,3,Medical,1,10,...,1,80,3,12,3,2,1,0,0,0
7,30,No,Travel_Rarely,1358,Research & Development,24,1,Life Sciences,1,11,...,2,80,1,1,2,3,1,0,0,0
8,38,No,Travel_Frequently,216,Research & Development,23,3,Life Sciences,1,12,...,2,80,0,10,2,3,9,7,1,8
9,36,No,Travel_Rarely,1299,Research & Development,27,3,Medical,1,13,...,2,80,2,17,3,2,7,7,7,7

In [65]:
#Found No null values
print("Null values",df.isnull().sum())
print("Information",df.info())

Null values age                           0
attrition                     0
business_travel               0
daily_rate                    0
department                    0
distance_from_home            0
education                     0
education_field               0
employee_count                0
employee_number               0
environment_satisfaction      0
gender                        0
hourly_rate                   0
job_involvement               0
job_level                     0
job_role                      0
job_satisfaction              0
marital_status                0
monthly_income                0
monthly_rate                  0
num_companies_worked          0
over18                        0
over_time                     0
percent_salary_hike           0
performance_rating            0
relationship_satisfaction     0
standard_hours                0
stock_option_level            0
total_working_years           0
training_times_last_year      0
work_life_balance             0
years_at_company              0
years_in_current_role         0
years_since_last_promotion    0
years_with_curr_manager       0
dtype: int64
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1470 entries, 0 to 1469
Data columns (total 35 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   age                         1470 non-null   int64
 1   attrition                   1470 non-null   object
 2   business_travel             1470 non-null   object
 3   daily_rate                  1470 non-null   int64
 4   department                  1470 non-null   object
 5   distance_from_home          1470 non-null   int64
 6   education                   1470 non-null   int64
 7   education_field             1470 non-null   object
 8   employee_count              1470 non-null   int64
 9   employee_number             1470 non-null   int64
 10  environment_satisfaction    1470 non-null   int64
 11  gender                      1470 non-null   object
 12  hourly_rate                 1470 non-null   int64
 13  job_involvement             1470 non-null   int64
 14  job_level                   1470 non-null   int64
 15  job_role                    1470 non-null   object
 16  job_satisfaction            1470 non-null   int64
 17  marital_status              1470 non-null   object
 18  monthly_income              1470 non-null   int64
 19  monthly_rate                1470 non-null   int64
 20  num_companies_worked        1470 non-null   int64
 21  over18                      1470 non-null   object
 22  over_time                   1470 non-null   object
 23  percent_salary_hike         1470 non-null   int64
 24  performance_rating          1470 non-null   int64
 25  relationship_satisfaction   1470 non-null   int64
 26  standard_hours              1470 non-null   int64
 27  stock_option_level          1470 non-null   int64
 28  total_working_years         1470 non-null   int64
 29  training_times_last_year    1470 non-null   int64
 30  work_life_balance           1470 non-null   int64
 31  years_at_company            1470 non-null   int64
 32  years_in_current_role       1470 non-null   int64
 33  years_since_last_promotion  1470 non-null   int64
 34  years_with_curr_manager     1470 non-null   int64
dtypes: int64(26), object(9)
memory usage: 402.1+ KB
Information None

In [66]:
df.describe()

,age,daily_rate,distance_from_home,education,employee_count,employee_number,environment_satisfaction,hourly_rate,job_involvement,job_level,...,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager
count,1470.000000,1470.000000,1470.000000,1470.000000,1470.0,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,...,1470.000000,1470.0,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000,1470.000000
mean,36.923810,802.485714,9.192517,2.912925,1.0,1024.865306,2.721769,65.891156,2.729932,2.063946,...,2.712245,80.0,0.793878,11.279592,2.799320,2.761224,7.008163,4.229252,2.187755,4.123129
std,9.135373,403.509100,8.106864,1.024165,0.0,602.024335,1.093082,20.329428,0.711561,1.106940,...,1.081209,0.0,0.852077,7.780782,1.289271,0.706476,6.126525,3.623137,3.222430,3.568136
min,18.000000,102.000000,1.000000,1.000000,1.0,1.000000,1.000000,30.000000,1.000000,1.000000,...,1.000000,80.0,0.000000,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000
25%,30.000000,465.000000,2.000000,2.000000,1.0,491.250000,2.000000,48.000000,2.000000,1.000000,...,2.000000,80.0,0.000000,6.000000,2.000000,2.000000,3.000000,2.000000,0.000000,2.000000
50%,36.000000,802.000000,7.000000,3.000000,1.0,1020.500000,3.000000,66.000000,3.000000,2.000000,...,3.000000,80.0,1.000000,10.000000,3.000000,3.000000,5.000000,3.000000,1.000000,3.000000
75%,43.000000,1157.000000,14.000000,4.000000,1.0,1555.750000,4.000000,83.750000,3.000000,3.000000,...,4.000000,80.0,1.000000,15.000000,3.000000,3.000000,9.000000,7.000000,3.000000,7.000000
max,60.000000,1499.000000,29.000000,5.000000,1.0,2068.000000,4.000000,100.000000,4.000000,5.000000,...,4.000000,80.0,3.000000,40.000000,6.000000,4.000000,40.000000,18.000000,15.000000,17.000000

In [67]:
# Converting Yes/No Columns to 1,0
y_n_Columns=['attrition','over_time']
for col in y_n_Columns:
    df[col]=df[col].map({'Yes':1,'No':0})

In [68]:
df.head()

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,...,relationship_satisfaction,standard_hours,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager
0,41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,1,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,0,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [69]:
#Attrition_Flag For Analysis
df['attrition_flag'] = df['attrition']
df[['attrition', 'attrition_flag']].head()

   attrition  attrition_flag
0          1               1
1          0               0
2          1               1
3          0               0
4          0               0

In [70]:
# Age Group For Analysis (Early Career',Mid Career, Senior Career,Senior / Experienced)
def age_group(age):
    if age < 30:
        return 'Early Career'
    elif age < 40:
        return 'Mid Career'
    elif age < 50:
        return 'Senior Career'
    else:
        return 'Senior / Experienced'

df['age_Group'] = df['age'].apply(age_group)

df[['age_Group','age']].head()

       age_Group  age
0  Senior Career   41
1  Senior Career   49
2     Mid Career   37
3     Mid Career   33
4   Early Career   27

In [40]:
def salary_band(salary):
    if salary < 4000:
        return 'Low'
    elif salary < 8000:
        return 'Medium'
    else:
        return 'High'

df['salary_band'] = df['monthly_income'].apply(salary_band)
df[['salary_band','monthly_income']].head()

  salary_band  monthly_income
0      Medium            5993
1      Medium            5130
2         Low            2090
3         Low            2909
4         Low            3468

In [82]:
# List of columns to clean values
columns_to_clean = ['department', 'education_field', 'job_role']

#  Cleaning values inside these columns (replacing spaces with _ and lowercase)
for col in columns_to_clean:
    df[col] = df[col].str.strip().str.replace(' ', '_').str.lower()

In [83]:
df.head()

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,...,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,attrition_flag,age_Group
0,41,1,Travel_Rarely,1102,sales,1,2,life_sciences,1,1,...,0,8,0,1,6,4,0,5,1,Senior Career
1,49,0,Travel_Frequently,279,research_&_development,8,1,life_sciences,1,2,...,1,10,3,3,10,7,1,7,0,Senior Career
2,37,1,Travel_Rarely,1373,research_&_development,2,2,other,1,4,...,0,7,3,3,0,0,0,0,1,Mid Career
3,33,0,Travel_Frequently,1392,research_&_development,3,4,life_sciences,1,5,...,0,8,3,3,8,7,3,0,0,Mid Career
4,27,0,Travel_Rarely,591,research_&_development,2,1,medical,1,7,...,1,6,3,3,2,2,2,2,0,Early Career

In [84]:
pip install pymysql sqlalchemy

Requirement already satisfied: pymysql in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (1.1.2)
Requirement already satisfied: sqlalchemy in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (2.0.45)
Requirement already satisfied: greenlet>=1 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from sqlalchemy) (3.3.0)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\appdata\local\programs\python\python311\lib\site-packages (from sqlalchemy) (4.15.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: C:\Users\User\AppData\Local\Programs\Python\Python311\python.exe -m pip install --upgrade pip

# Connecting SQL DATABASE

In [85]:

from sqlalchemy import create_engine

# MySQL connection
username = "root"
password = "3980butwhatAKA$"
host = "localhost"
port = "3306"
database = "HR_database"

engine = create_engine(f"mysql+pymysql://{username}:{password}@{host}:{port}/{database}")

# Write DataFrame to MySQL
table_name = "hr_data"   # choose any table name
df.to_sql(table_name, engine, if_exists="replace", index=False)

# Read back sample
pd.read_sql("SELECT * FROM customer LIMIT 5;", engine)

,age,attrition,business_travel,daily_rate,department,distance_from_home,education,education_field,employee_count,employee_number,...,stock_option_level,total_working_years,training_times_last_year,work_life_balance,years_at_company,years_in_current_role,years_since_last_promotion,years_with_curr_manager,attrition_flag,age_Group
0,41,1,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,0,8,0,1,6,4,0,5,1,Senior Career
1,49,0,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,1,10,3,3,10,7,1,7,0,Senior Career
2,37,1,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,0,7,3,3,0,0,0,0,1,Mid Career
3,33,0,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,0,8,3,3,8,7,3,0,0,Mid Career
4,27,0,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,1,6,3,3,2,2,2,2,0,Early Career